app/controllers/mensajes_controller.rb

SELECT "mensajes".* FROM "mensajes"
---
  def index
    @mensajes = Mensaje.all

INSERT INTO "mensajes" ("nombre", "correo", "mensaje", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nombre", "Juan Perez"], ["correo", "juan@perez.com"], ["mensaje", "Mi nombre es juan perez"], ["created_at", "2017-04-14 16:18:10.297532"], ["updated_at", "2017-04-14 16:18:10.297532"]]
---
  def create
    @mensaje = Mensaje.new(mensaje_params)

    respond_to do |format|
      if @mensaje.save

SELECT  "mensajes".* FROM "mensajes" WHERE "mensajes"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_mensaje
      @mensaje = Mensaje.find(params[:id])